console.log(1 + 1); //2
console.log(1 - 1); //0
console.log(1 * 1); //1
console.log(1 / 1); //1
console.log(4 % 2); //2
console.log(0.1 + 0.2); //不是0.3其他的语言也会有运算的问题。
//不能直接拿着浮点数进行比较。
num = 1
    ++num //前置自增，相当于num=num+1，//先相加，后返回
num++ //后置自增，相当于num=num+1先返回，后相加。

a = 10
    ++a //++a=11 a=11
b = ++a + 2 //a=12 ++a=12 b=14

c = 10
c++ //c++=11 c=11
d = c++ + 2 //c++=11 c=12 d=13

e = 10
f = e++ + ++e //e++=10 e=11 2.e=12 ++e=12

//后置自增，先表达式返回原值，后面变量再自加1
//前置自增，先相加，后返回值

console.log(18 == '18');

console.log(123 || 456); //123
console.log(0 || 456); //456
console.log(123 || 456 || 789); //123